// 四角形で時分秒を表現

void setup() {
  size(600, 600);
  noStroke();
}

void draw() {
  background(255, 255, 255);

  // 時針の枠
  fill(200, 200, 200);
  rect(100, 250, 100, 100, 4);
  // 時針
  fill(0, 0, 0);
  rect(
    150 - (100 * hour() / 23) / 2,
    300 - (100 * hour() / 23) / 2,
    // 時 (0 ~ 23) を元に四角形のサイズ (0 ~ 100) を計算 
    100 * hour() / 23,
    100 * hour() / 23,
    4
  );

  // 分針の枠
  fill(200, 200, 200);
  rect(250, 250, 100, 100, 4);
  // 分針
  fill(0, 0, 0);
  rect(
    300 - (100 * minute() / 59) / 2,
    300 - (100 * minute() / 59) / 2,
    100 * minute() / 59,
    100 * minute() / 59,
    4
  );

  // 時針の枠
  fill(200, 200, 200);
  rect(400, 250, 100, 100, 4);
  // 時針
  fill(0, 0, 0);
  rect(
    450 - (100 * second() / 59) / 2,
    300 - (100 * second() / 59) / 2,
    100 * second() / 59,
    100 * second() / 59,
    4
  );
}
